[
  {
    "speaker": "main",
    "content": "Alright, let's look at this story about Baek Jin-eon from the Korea Institute for Advanced Study. A Korean mathematician has won international recognition for solving a geometry puzzle that had resisted proof for nearly six decades. U S magazine Scientific American named the research by Baek Jin-eon among its top ten mathematical breakthroughs of twenty twenty-five, the mathematics community said on Sunday. Baek, thirty-one, is a research fellow at the June E Huh Center for Mathematical Challenges at the Korea Institute for Advanced Study. The so-called moving sofa problem asks how large a rigid shape can be while still being able to pass around a right-angled corner in an L-shaped corridor of a constant width of one meter. First posed in nineteen sixty-six by Austrian-Canadian mathematician Leo Moser, the puzzle became widely known because it can be understood without advanced mathematics and has appeared in U S textbooks. Over decades, researchers proposed increasingly efficient shapes while narrowing the possible range of solutions, but were unable to prove where the upper limit lay. In nineteen sixty-eight, British mathematician John Hammersley introduced a shape with an area of about two point two zero seven four square meters. In nineteen ninety-two, Rutgers University professor Joseph Gerver proposed a more complex curved figure with an area of roughly two point two one nine five square meters, which became the leading candidate. Although Gerver's design emerged as the leading candidate, no proof had shown that a larger shape was impossible. Baek's work aimed to settle that question. After seven years of research, he released a one hundred nineteen-page paper in late twenty twenty-four on the preprint server arXiv, arguing that Gerver's figure represents a hard upper limit. Unlike earlier studies that relied heavily on computer-assisted estimates, Baek used logical reasoning to establish optimality. Describing the research process, Baek compared it to repeatedly building and discarding ideas. He said, \"You keep holding on to hope, then breaking it, and moving forward by picking up ideas from the ashes,\" in an interview with a web magazine published by Korean Institute for Advanced Study. He added, \"I'm closer to a daydreamer by nature, and for me mathematical research is a repetition of dreaming and waking up.\" The paper is now under review at Annals of Mathematics, one of the field's most selective journals. Baek said the problem appealed to him because it lacked a clear theoretical framework. \"This sofa problem doesn't have much historical context, and it wasn't even clear whether there was theory behind it,\" he said. \"I tried to connect it to existing ideas and turn it into an optimization problem, creating tools suited to the question.\" He added that progress in such problems takes time, saying, \"It takes a long time for a problem to gain context. I feel like I planted a small seed.\" Baek completed his doctorate at the University of Michigan and previously served as a research specialist at the National Institute for Mathematical Sciences. He solved the problem at age twenty-nine while working as a postdoctoral researcher at Yonsei University. I can barely get a real couch through my front door, so hats off to him for figuring out the math. That's the story on that one."
  }
]