[
  {
    "speaker": "main",
    "content": "Following our previous coverage in parts one, two, and three, we discovered that entire sections describing domestic U.S. intelligence facilities were deliberately removed from two published documents, while equivalent foreign facilities remained visible. The evidence exists in an unexpected place: the PDF metadata of documents published by The Intercept in 2016, and by The Intercept and the Australian Broadcasting Corporation in a 2017 collaborative investigation. To our knowledge, this is the first time this information has been revealed publicly. The removed sections reveal the operational designations and cover name structure for domestic U.S. NRO Mission Ground Stations. Using PDF analysis tools, we found hidden text embedded in the metadata versioning of two documents published alongside investigative stories about NSA satellite surveillance facilities. These metadata artifacts prove that earlier versions of the documents contained detailed descriptions of domestic U.S. ground stations that were systematically scrubbed before publication—not just redacted with black boxes, but with text completely removed. When we look at what was published from the Snowden documents, we see operational details for RAF Menwith Hill Station in the UK and Pine Gap in Australia. However, what was removed from the published documents includes the Potomac Mission Ground Station, or PMGS, in Washington, DC, which uses the public cover name 'Classic Wizard Reporting and Testing Center.' Also removed was the Consolidated Denver Mission Ground Station, or CDMGS, near Denver, which uses the public cover name 'Aerospace Data Facility.' The facilities themselves are not unknown. The 'Aerospace Data Facility' at Buckley Space Force Base is publicly acknowledged as a National Reconnaissance Office Mission Ground Station, and the 'Classic Wizard Reporting and Testing Center' at the Naval Research Laboratory is also publicly acknowledged, though its designation as a Mission Ground Station is less clear. What is not public—until now—is the specific operational designations used in classified networks: 'Consolidated Denver Mission Ground Station' and 'Potomac Mission Ground Station.' The Snowden documents prove these are deliberate cover names, not just alternative terminology, and they show exactly what is classified and what is not. Regarding the hidden PDF versions, the first document, titled 'Menwith satellite classification guide,' has two versions in the file metadata: an older one and a newer one. The removed information exists in the earlier version and is completely removed in the second, published version. This is not standard redaction; the text was completely deleted from the visible document while remaining embedded in the PDF's internal version history. In the first version of the document, section 5.1.5.2 identifies the facility formally as the Mission Support Facility, also referred to as the Classic Wizard Reporting and Testing Center. Section 5.1.5.3 notes that the fact of a cover story is classified 'S-slash-slash-T-K,' while the cover story itself is unclassified. Section 5.1.5.4 describes the work as software development, maintenance, testing, and communications support to a worldwide Navy communications system. Then, section 5.1.5.5 lists several key associations. It states that the term 'Potomac Mission Ground Station' equals 'S-slash-slash-T-K,' while 'Classic Wizard Reporting and Testing Center' and 'Naval Research Laboratory' are unclassified. It notes that the fact that the CWRTC is the cover name for the PMGS is 'S-slash-slash-T-K,' as is the fact that the PMGS is located on the NRL. It also classifies the association of NRO, CIA, or NSA personnel with the facility as 'S-slash-slash-T-K.' Finally, section 5.1.5.6 notes that the CWRTC is housed within buildings 259 and 260 on the Naval Research Laboratory in Southwest Washington, DC. The second document, the 'NRO SIGINT Guide for Pine Gap,' also contains two versions. The hidden text in section 5.1.2 describes the Consolidated Denver Mission Ground Station, or CDMGS. Section 5.1.2.1 lists the facility name as the Aerospace Data Facility, and section 5.1.2.2 confirms again that the fact of a cover story is 'S-slash-slash-T-K.' In the hidden version of the Menwith guide, we see that the classified operational designation is Potomac Mission Ground Station. Its public cover story involves Navy communications, but its actual function is as a Mission Ground Station in the NRO's satellite intelligence network. The document explicitly states that 'the fact of a cover story is S-slash-slash-T-K,' meaning even acknowledging that CWRTC is a cover name is classified Secret/Talent Keyhole. This layered classification allows the facility to operate under a public identity while keeping its actual intelligence designation and function secret. Similarly, for the Denver facility, while it is publicly known as 'Aerospace Data Facility-Colorado,' what is not public is the operational designation 'Consolidated Denver Mission Ground Station' and the fact that its name is a cover. Both hidden facilities appear in an organizational classification table in the Pine Gap guide. The table's visual structure reveals which names refer to the same facilities through deliberate formatting. The groupings show that the Denver facility includes the CDMGS real designation plus the cover names ADF and FSD, or Field Station Denver. The Potomac facility includes the PMGS designation along with the MSF and CWRTC cover names. For each facility, the real operational designation has all agency associations classified 'S-slash-slash-T-K.' But the cover names have NSA and NGA associations marked as unclassified or 'U-slash-slash-F-O-U-O.' This creates a system where you can publicly acknowledge intelligence work using sanitized facility names while the actual operational designations remain secret. The domestic facilities use two cover names each, while foreign facilities use only one, suggesting layered operational security for facilities on U.S. soil. There is a deliberate pattern in these two classification guides: detailed sections describing specific U.S. facilities were removed, while equivalent foreign facility sections were published intact. The 2016 Menwith Hill guide had its PMGS section completely removed, and the 2017 Pine Gap guide had its CDMGS section removed. While U.S. facilities were not entirely absent from the published documents, the detailed classification guide sections that would have explained them were specifically targeted. So, who edited the documents? PDF metadata provides forensic evidence of the editing process. The Pine Gap guide shows timestamps from July 31, 2017. Two versions were created minutes apart using Nitro Pro 8: version 1 at 13:48 and version 2 at 13:50, with the CDMGS section removed in the latter. Both The Intercept and ABC published identical PDFs with the same metadata artifacts. We contacted Ryan Gallagher, the journalist who led both investigations, to ask about the editorial decision to remove these sections, but we have not received a response. In our next part, we will provide a technical deep-dive into PDF metadata across the published Snowden documents. We found that many documents contain multiple versions, revealing visible NSA agents' usernames that were later removed, and surveillance data that went through multiple rounds of redaction. We will also document cases of failed redactions, including one where redacted text remained fully copyable. As a final note, you can extract versions from a PDF file using a tool like 'pdfresurrect,' and you can download the document versions we discussed directly through the provided links for the Menwith and Pine Gap guides."
  }
]